doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
#+TODO: TODO | DONE
#+TITLE:     User Testing Requirements (clojure 1.9.0)
#+AUTHOR:    Keith D Houser
#+DESCRIPTION: kdh/stax requirements on Clojure 1.9.0
#+KEYWORDS:  syntax, org, document
#+LANGUAGE:  en
#+OPTIONS:   H:5 num:nil toc:4 p:t e:nil
#+STARTUP: entitiespretty
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <style> pre.src{background:black;color:white;} </style>
#+HTML_HEAD: <style> div#text-table-of-contents code {color:black;background:lightgray;} </style>  
#+PROPERTY: header-args :eval never-export

* User Testing Requirements (clojure 1.9.0)
** DONE Explicit Requirements
CLOSED: [2022-07-29 Fri 16:10]
   Explicit requirements are taken directly from the assignment. They are split into individual testable requirements, and designated *req-e-#:* where *e* means explicit, and *#* is a number.

*** SETUP
#+begin_src clj
,*ns*
(=> #namespace[stax-user.core] )

(clojure-version)
(=> "1.9.0" )

(use 'kdh.stax.core)
(=> nil )

;; patch for clojure 1.9.0
(def ex-message kdh.stax.errs/ex-message)
#+end_src
   
*** DONE <<req-e-01>> *req-e-01*: Variables are symbols prefixed with "!", e.g. !v
CLOSED: [2022-07-29 Fri 15:49]
~kdh.stax.nodify/nodify-op~ will create a node of type ~:kdh.stax.node/push-var~ iff the op passes the predicate ~kdh.stax.node/!symbol?~
#+begin_src clj :exports code
(defn !symbol?
  "True if op matches symbol of the form !v where v is anything but ! or +"
  [op]
  (and (symbol? op)
	   (boolean (re-find #"^![^!\+]+$" (name op)))))
#+end_src
    
declarations argument to defstackfn is also checked to pass ~kdh.stax.node/!symbol?~ in its :pre condition.

#+name: f-req-e-01
#+begin_src clj :exports code
(defstackfn f-req-e-01 [a b c] a b c)
;;!>  FAIL in () (core.clj:85)
;; expected: (every? !symbol? declarations)
;;   actual: (not (every? #function[kdh.stax.node/!symbol?] [a b c]))
#+end_src
*** DONE <<req-e-02>> *req-e-02*: A stack function is defined with "defstackfn"
CLOSED: [2022-07-29 Fri 15:50]

Define a trivial stack function (with no declarations and only push numbers).

#+name: f-req-e-02
#+begin_src clj :exports code
(defstackfn f-req-e-02 [] 1 2 3)
(=> #'user/f-req-e-02 )

(f-req-e-02)
(=> [1 2 3] )
#+end_src

*** DONE <<req-e-03>> *req-e-03*: The first argument is the input declaration which also provides variable names to the arguments
CLOSED: [2022-07-29 Fri 15:50]

#+name: f-req-e-03
#+begin_src clj :exports code
(defstackfn f-req-e-03 [!a !b !c] !b !a !c)
(=> #'user/f-req-e-03 )

(f-req-e-03 :a :b :c)
(=> [:b :a :c] )
#+end_src

