doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-01 Mon 16:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>User Testing Requirements (clojure 1.9.0)</title>
<meta name="author" content="Keith D Houser" />
<meta name="description" content="kdh/stax requirements on Clojure 1.9.0" />
<meta name="keywords" content="syntax, org, document" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">User Testing Requirements (clojure 1.9.0)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8d1d9dc">User Testing Requirements (clojure 1.9.0)</a>
<ul>
<li><a href="#org449b536"><span class="done DONE">DONE</span> Explicit Requirements</a>
<ul>
<li><a href="#org8a30834">SETUP</a></li>
<li><a href="#orgf3badd8"><span class="done DONE">DONE</span> <b>req-e-01</b>: Variables are symbols prefixed with "!", e.g. !v</a></li>
<li><a href="#org9a77f17"><span class="done DONE">DONE</span> <b>req-e-02</b>: A stack function is defined with "defstackfn"</a></li>
<li><a href="#org9b84a37"><span class="done DONE">DONE</span> <b>req-e-03</b>: The first argument is the input declaration which also provides variable names to the arguments</a></li>
<li><a href="#orgc102e32"><span class="done DONE">DONE</span> <b>req-e-04</b>: The stack always starts empty</a></li>
<li><a href="#org0042fc7"><span class="done DONE">DONE</span> <b>req-e-05</b>: The implementation of a stackfn is a sequence of stack operations</a></li>
<li><a href="#org6f58e87"><span class="done DONE">DONE</span> <b>req-e-06</b>: Using a constant as a stack operation pushes that value onto the stack</a></li>
<li><a href="#orgae8d6c8"><span class="done DONE">DONE</span> <b>req-e-07</b>: A variable is assigned the top value of the stack by appending "​+" to the variable name,  e.g. !v​+</a></li>
<li><a href="#orge661263"><span class="done DONE">DONE</span> <b>req-e-08</b>: A function is invoked with "invoke&gt;".</a></li>
<li><a href="#org28c2ba7"><span class="done DONE">DONE</span> <b>req-e-09</b>: "invoke&gt;" takes as input the operation</a></li>
<li><a href="#org1461745"><span class="done DONE">DONE</span> <b>req-e-10</b>: "invoke&gt;" takes as input the arity to use</a></li>
<li><a href="#orgc446cf0"><span class="done DONE">DONE</span> <b>req-e-11</b>: &lt;pop&gt; is a special operation which removes the top value of the stack</a></li>
<li><a href="#orgb7a83f6"><span class="done DONE">DONE</span> <b>req-e-12</b>: if&gt; tests if the top value of the stack is truthy to determine which branch to follow.</a></li>
<li><a href="#org2cf6959"><span class="done DONE">DONE</span> <b>req-e-13</b>: The branches of if are separated with "else&gt;"</a></li>
<li><a href="#orgeabfb49"><span class="done DONE">DONE</span> <b>req-e-14</b>: defstackfn should be a macro</a></li>
<li><a href="#orge9a3871"><span class="done DONE">DONE</span> <b>req-e-15</b>: defstackfn should produce a function invokable like any other function.</a></li>
<li><a href="#orgfc55ccd"><span class="done DONE">DONE</span> <b>req-e-16</b>: defstackfn should provide an informative error if there's an invalid stack operation</a></li>
<li><a href="#org87d1510"><span class="done DONE">DONE</span> <b>req-e-17</b>: defstackfn should provide an informative error if there's a variable is referenced that doesn't exist.</a></li>
<li><a href="#org6644bf3"><span class="done DONE">DONE</span> <b>req-e-18</b>: It should be possible to shadow vars (naming a new local the name of an existing variable).</a></li>
<li><a href="#org47b36cb"><span class="done DONE">DONE</span> <b>req-e-19</b>: The example below contains all functionality you need to implement.</a></li>
</ul>
</li>
<li><a href="#org68fd779"><span class="done DONE">DONE</span> Implicit requirements (<b>req-i-#</b>)</a>
<ul>
<li><a href="#org304409c"><span class="done DONE">DONE</span> <b>req-i-01</b>: <code>defstackfn</code> can take an empty declarations argument</a></li>
<li><a href="#orgd910c6c"><span class="done DONE">DONE</span> <b>req-i-02</b>: <code>if&gt;</code> consumes the top of the stack</a></li>
<li><a href="#org882b0bd"><span class="done DONE">DONE</span> <b>req-i-03</b>: <code>!v​+</code> (define variable and assign it top of stack) does not consume the top of the stack</a></li>
<li><a href="#orgbf585b9"><span class="done DONE">DONE</span> <b>req-i-04</b>: <code>(invoke&gt; fun n)</code> applies n items off the top of the stack in stack order (i.e. reverse of underlying vector's order)</a></li>
<li><a href="#org29a3bee"><span class="done DONE">DONE</span> <b>req-i-05</b>: <code>(invoke&gt; fun n)</code> for the sake of consistency, the return value of invoke should be <i>constant</i> (i.e. self-evaluating)</a></li>
<li><a href="#orgafdb022"><span class="done DONE">DONE</span> <b>req-i-06</b>: For the sake of consistency, values passed to the defstackfn defined function should be <i>constant</i> (i.e. self-evaluating)</a></li>
<li><a href="#org20e3404"><span class="done DONE">DONE</span> <b>req-i-07</b>: <code>kdh.stax.core/defstackfn</code> creates a named function that returns the remaining stack as a vector</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd659c2">Environment</a>
<ul>
<li><a href="#org43d8545">Java Properties</a></li>
<li><a href="#orgfd96a20">Java Class Path</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8d1d9dc" class="outline-2">
<h2 id="org8d1d9dc">User Testing Requirements (clojure 1.9.0)</h2>
<div class="outline-text-2" id="text-org8d1d9dc">
</div>
<div id="outline-container-org449b536" class="outline-3">
<h3 id="org449b536"><span class="done DONE">DONE</span> Explicit Requirements</h3>
<div class="outline-text-3" id="text-org449b536">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:10]</span></span></p>
<p>
Explicit requirements are taken directly from the assignment. They are split into individual testable requirements, and designated <b>req-e-#:</b> where <b>e</b> means explicit, and <b>#</b> is a number.
</p>
</div>

<div id="outline-container-org8a30834" class="outline-4">
<h4 id="org8a30834">SETUP</h4>
<div class="outline-text-4" id="text-org8a30834">
<div class="org-src-container">
<pre class="src src-clj"><span style="color: #ff9029;">*ns*</span>
(=&gt; #namespace[user] )

(clojure-version)
(=&gt; <span style="color: #ff7fff;">"1.9.0"</span> )

(use 'kdh.stax.core)
(=&gt; <span style="color: #34c8d8; font-weight: bold;">nil</span> )

<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">patch for clojure 1.9.0</span>
(<span style="color: #ffff0b;">def</span> <span style="color: #4ac964;">ex-message</span> <span style="color: #9fcb66;">kdh.stax.errs</span>/ex-message)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3badd8" class="outline-4">
<h4 id="orgf3badd8"><span class="done DONE">DONE</span> <a id="org6122d14"></a> <b>req-e-01</b>: Variables are symbols prefixed with "!", e.g. !v</h4>
<div class="outline-text-4" id="text-orgf3badd8">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:49]</span></span></p>
<p>
<code>kdh.stax.nodify/nodify-op</code> will create a node of type <code>:kdh.stax.node/push-var</code> iff the op passes the predicate <code>kdh.stax.node/!symbol?</code>
</p>
<div class="org-src-container">
<pre class="src src-clj">(<span style="color: #ffff0b;">defn</span> <span style="color: #ff996f;">!symbol?</span>
  <span style="color: #fd95fa; font-style: italic;">"True if op matches symbol of the form !v where v is anything but ! or +"</span>
  [op]
  (<span style="color: #ffff0b;">and</span> (symbol? op)
           (boolean (re-find #<span style="color: #ff7fff;">"^![^!</span><span style="color: #ffffff; font-weight: bold;">\+</span><span style="color: #ff7fff;">]+$"</span> (name op)))))
</pre>
</div>

<p>
declarations argument to defstackfn is also checked to pass <code>kdh.stax.node/!symbol?</code> in its :pre condition.
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgd7cb9d0">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-01</span> [a b c] a b c)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">!&gt;  FAIL in () (core.clj:85)</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">expected: (every? !symbol? declarations)</span>
<span style="color: #767283;">;;   </span><span style="color: #767283; font-style: italic;">actual: (not (every? #function[kdh.stax.node/!symbol?] [a b c]))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9a77f17" class="outline-4">
<h4 id="org9a77f17"><span class="done DONE">DONE</span> <a id="org90a27c4"></a> <b>req-e-02</b>: A stack function is defined with "defstackfn"</h4>
<div class="outline-text-4" id="text-org9a77f17">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:50]</span></span></p>

<p>
Define a trivial stack function (with no declarations and only push numbers).
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgea74b87">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-02</span> [] 1 2 3)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-02 )

(f-req-e-02)
(=&gt; [1 2 3] )
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b84a37" class="outline-4">
<h4 id="org9b84a37"><span class="done DONE">DONE</span> <a id="org6fd37c6"></a> <b>req-e-03</b>: The first argument is the input declaration which also provides variable names to the arguments</h4>
<div class="outline-text-4" id="text-org9b84a37">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:50]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="org238876c">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-03</span> [!a !b !c] !b !a !c)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-03 )

(f-req-e-03 <span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:c</span>)
(=&gt; [<span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:c</span>] )
</pre>
</div>
</div>
</div>
