doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-e-04>> *req-e-04*: The stack always starts empty
CLOSED: [2022-07-29 Fri 15:54]

Let's pop an empty stack to see what happens

#+name: f-req-e-04
#+begin_src clj :exports code
(defstackfn f-req-e-04 [] <pop>)
;;+>
;; 1st Path Errors [>-start-term->]:
;; 	`<pop>' at op[0] node[0]:
;; 		 stack size=0, operation <pop> needs >=1
(=> :kdh.stax.errs/defstackfn-produced-errors )
#+end_src

I don't like to throw errors during dev, it's disruptive.  Instead, I return meaningful keys (here ~:kdh.stax.errs/defstackfn-produced-errors~).

However, I recognize that others like Exceptions, so I allow them with a dynamic binding...

#+name: f-req-e-04-with-exception
#+begin_src clj :exports code
(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (defstackfn f-req-e-04 [] <pop>)
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["defstackfn produced errors"
  {:error-data [["1st Path Errors [>-start-term->]: "
		     [{:op-type :kdh.stax.node/op=pop,
		       :needs 1,
		       :delta -1,
		       :op <pop>,
		       :node-index [0],
		       :op-index [0],
		       :errors [{:err-zone :kdh.stax.errors/zone=path,
				 :err-type :kdh.stax.errors/error=static-insufficient-stack,
				 :err-text "stack size=0,
operation <pop> needs >=1"}]}]]],
   :error-text "\n1st Path Errors [>-start-term->]: \n\t`<pop>' at op[0] node[0]:\n\t\t stack size=0, operation <pop> needs >=1\n"}]
)
#+end_src

Exceptions or not, I've proved the stack is initially empty!

*** DONE <<req-e-05>> *req-e-05*: The implementation of a stackfn is a sequence of stack operations
CLOSED: [2022-07-29 Fri 15:55]
#+name: f-req-e-05
#+begin_src clj
(defstackfn f-req-e-05 [!a] !a 2 <pop> 3 (invoke> = 2)
  (if> "!a == 3" else> "!a <> 3") (invoke> println 1))
(=> #'user/f-req-e-05 )

(f-req-e-05 1)
;;+ !a <> 3
(=> [nil] )

(f-req-e-05 3)
;;+ !a == 3
(=> [nil] )
#+end_src
*** DONE <<req-e-06>> *req-e-06*: Using a constant as a stack operation pushes that value onto the stack
CLOSED: [2022-07-29 Fri 15:55]

In my implementation, I interpret /constant/ as a form that evaluates to itself.

The Clojure reference page on evaluation]] says:

#+begin_quote
Strings, numbers, characters, true, false, nil and keywords evaluate to themselves.
#+end_quote

That quote is part of the documentation string for my function ~ksh.stax.node/self-evaluating?~:

#+begin_src clj :exports code
(clojure.repl/doc kdh.stax.node/self-evaluating?)
;;+>
;; -------------------------
;; kdh.stax.node/self-evaluating?
;; ([op])
;;     True if op is a self evaluating form.
;;   https://clojure.org/reference/evaluation says 'Strings, numbers, characters, true, false, nil and keywords evaluate to themselves.'
#+end_src

Let's push one of each onto the stack

#+name: f-req-e-06
#+begin_src clj :exports code
(defstackfn f-req-e-06 [] "string" 42 \z true false nil :bubba)
(=> #'user/f-req-e-06 )

(f-req-e-06)
(=> ["string" 42 \z true false nil :bubba] )
#+end_src

*** DONE <<req-e-07>> *req-e-07*: A variable is assigned the top value of the stack by appending "​+" to the variable name,  e.g. !v​+
CLOSED: [2022-07-29 Fri 15:56]

#+name: f-req-e-07
#+begin_src clojure :ns user :results value pp :exports both
(defstackfn f-req-e-07 [] "string" 42 !v1+ \z true false nil :bubba !v1)
(=> #'user/f-req-e-07 )

(f-req-e-07)
(=> ["string" 42 \z true false nil :bubba 42] )
#+end_src

!v1+ assigned the top of the stack (42) to the variable !v1 as evidenced by the top of the returned stack after the final !v1 push.

