doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html

<div id="outline-container-orgc102e32" class="outline-4">
<h4 id="orgc102e32"><span class="done DONE">DONE</span> <a id="org13944ec"></a> <b>req-e-04</b>: The stack always starts empty</h4>
<div class="outline-text-4" id="text-orgc102e32">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:54]</span></span></p>

<p>
Let's pop an empty stack to see what happens
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org40556f7">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-04</span> [] &lt;pop&gt;)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">1st Path Errors [&gt;-start-term-&gt;]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `&lt;pop&gt;' at op[0] node[0]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              stack size=0, operation &lt;pop&gt; needs &gt;=1</span>
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">defstackfn-produced-errors</span> )
</pre>
</div>

<p>
I don't like to throw errors during dev, it's disruptive.  Instead, I return meaningful keys (here <code>:kdh.stax.errs/defstackfn-produced-errors</code>).
</p>

<p>
However, I recognize that others like Exceptions, so I allow them with a dynamic binding&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org4a19cec">(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-04</span> [] &lt;pop&gt;)
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"defstackfn produced errors"</span>
  {<span style="color: #34c8d8; font-weight: bold;">:error-data</span> [[<span style="color: #ff7fff;">"1st Path Errors [&gt;-start-term-&gt;]: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=pop</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:needs</span> 1,
                       <span style="color: #34c8d8; font-weight: bold;">:delta</span> -1,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> &lt;pop&gt;,
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [0],
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [0],
                       <span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=path</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=static-insufficient-stack</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"stack size=0,</span>
<span style="color: #ff7fff;">operation &lt;pop&gt; needs &gt;=1"</span>}]}]]],
   <span style="color: #34c8d8; font-weight: bold;">:error-text</span> <span style="color: #ff7fff;">"</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">1st Path Errors [&gt;-start-term-&gt;]: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`&lt;pop&gt;' at op[0] node[0]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> stack size=0, operation &lt;pop&gt; needs &gt;=1</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">"</span>}]
)
</pre>
</div>

<p>
Exceptions or not, I've proved the stack is initially empty!
</p>
</div>
</div>

<div id="outline-container-org0042fc7" class="outline-4">
<h4 id="org0042fc7"><span class="done DONE">DONE</span> <a id="org512201a"></a> <b>req-e-05</b>: The implementation of a stackfn is a sequence of stack operations</h4>
<div class="outline-text-4" id="text-org0042fc7">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:55]</span></span></p>
<div class="org-src-container">
<pre class="src src-clj" id="orgfd80852">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-05</span> [!a] !a 2 &lt;pop&gt; 3 (invoke&gt; = 2)
  (if&gt; <span style="color: #ff7fff;">"!a == 3"</span> else&gt; <span style="color: #ff7fff;">"!a &lt;&gt; 3"</span>) (invoke&gt; println 1))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-05 )

(f-req-e-05 1)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+ !a &lt;&gt; 3</span>
(=&gt; [<span style="color: #34c8d8; font-weight: bold;">nil</span>] )

(f-req-e-05 3)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+ !a == 3</span>
(=&gt; [<span style="color: #34c8d8; font-weight: bold;">nil</span>] )
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f58e87" class="outline-4">
<h4 id="org6f58e87"><span class="done DONE">DONE</span> <a id="orgfba66ca"></a> <b>req-e-06</b>: Using a constant as a stack operation pushes that value onto the stack</h4>
<div class="outline-text-4" id="text-org6f58e87">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:55]</span></span></p>

<p>
In my implementation, I interpret <i>constant</i> as a form that evaluates to itself.
</p>

<p>
The Clojure reference page on evaluation]] says:
</p>

<blockquote>
<p>
Strings, numbers, characters, true, false, nil and keywords evaluate to themselves.
</p>
</blockquote>

<p>
That quote is part of the documentation string for my function <code>ksh.stax.node/self-evaluating?</code>:
</p>

<div class="org-src-container">
<pre class="src src-clj">(<span style="color: #9fcb66;">clojure.repl</span>/doc <span style="color: #9fcb66;">kdh.stax.node</span>/self-evaluating?)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">-------------------------</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">kdh.stax.node/self-evaluating?</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">([op])</span>
<span style="color: #767283;">;;     </span><span style="color: #767283; font-style: italic;">True if op is a self evaluating form.</span>
<span style="color: #767283;">;;   </span><span style="color: #767283; font-style: italic;">https://clojure.org/reference/evaluation says 'Strings, numbers, characters, true, false, nil and keywords evaluate to themselves.'</span>
</pre>
</div>

<p>
Let's push one of each onto the stack
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgdd4ebf1">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-06</span> [] <span style="color: #ff7fff;">"string"</span> 42 <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span>)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-06 )

(f-req-e-06)
(=&gt; [<span style="color: #ff7fff;">"string"</span> 42 <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span>] )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae8d6c8" class="outline-4">
<h4 id="orgae8d6c8"><span class="done DONE">DONE</span> <a id="org06bd765"></a> <b>req-e-07</b>: A variable is assigned the top value of the stack by appending "​+" to the variable name,  e.g. !v​+</h4>
<div class="outline-text-4" id="text-orgae8d6c8">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:56]</span></span></p>

<div class="org-src-container">
<pre class="src src-clojure" id="orgfea6b07">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-07</span> [] <span style="color: #ff7fff;">"string"</span> 42 !v1+ <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span> !v1)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-07 )

(f-req-e-07)
(=&gt; [<span style="color: #ff7fff;">"string"</span> 42 <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span> 42] )
</pre>
</div>

<p>
!v1+ assigned the top of the stack (42) to the variable !v1 as evidenced by the top of the returned stack after the final !v1 push.
</p>
</div>
</div>
