doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-e-08>> *req-e-08*: A function is invoked with "invoke>".
CLOSED: [2022-07-29 Fri 15:56]

#+name: f-req-e-08
#+begin_src clj :exports code
(defstackfn f-req-e-08 [] "string" 42 !v1+ \z true false nil :bubba !v1 (invoke> println 1))
(=> #'user/f-req-e-08 )

(f-req-e-08)
;;+> 42
(=> ["string" 42 \z true false nil :bubba nil] )
#+end_src

*** DONE <<req-e-09>> *req-e-09*: "invoke>" takes as input the operation
CLOSED: [2022-07-29 Fri 15:56]

The first argument to ~invoke>~ must be a function (in this example ~+~)

#+name: f-req-e-09
#+begin_src clj :exports code
(defstackfn f-req-e-09 [!a !b] !a !b (invoke> + 2))
(=> #'user/f-req-e-09 )

(f-req-e-09 2 3)
(=> [5] )

(f-req-e-09 :foo "bar")
;;+>
;; RUNTIME ERRORS:
;; 	`(invoke> + 2)' at op[2] node[2]:
;; 		 `(apply #'clojure.core/+ ("bar" :foo))' failed during execution (class java.lang.String cannot be cast to class java.lang.Number (java.lang.String and java.lang.Number are in module java.base of loader 'bootstrap'))
(=> :kdh.stax.errs/stackfn-produced-runtime-error )
#+end_src

The error is not on the function, but on its arguments. I include it to show that '+ became #'clojure.core/+

*** DONE <<req-e-10>> *req-e-10*: "invoke>" takes as input the arity to use
CLOSED: [2022-07-29 Fri 16:01]

My implementation only accepts pos-int arity, as I understand invoke> to invoke a function on stack values.

#+name: f-req-e-10
#+begin_src clj :exports code
(defstackfn f-req-e-10 [!a !b] !a !b (invoke> + 2))
(=> #'user/f-req-e-10 )

(f-req-e-10 2 3)
(=> [5] )

(defstackfn f-req-e-10* [!a !b] !a !b (invoke> + 0))
;;+>
;; Global Operation Tree Errors: 
;; 	`(invoke> + 0)' at op[2] node[2]:
;; 		 0 is not a valid arity (must be pos-int)!
(=> :kdh.stax.errs/defstackfn-produced-errors )
#+end_src

Or, if you prefer Exceptions...

#+name: f-req-e-10-with-exception
#+begin_src clj :exports code
(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (defstackfn f-req-e-10* [!a !b] !a !b (invoke> + 0))
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["defstackfn produced errors"
  {:error-data [["Global Operation Tree Errors: "
                 [{:op-type :kdh.stax.node/op=invoke,
                   :op (invoke> + 0),
                   :fun +,
                   :arity 0,
                   :errors [{:err-zone :kdh.stax.errs/zone=tree,
                             :err-type :kdh.stax.errs/error=parse-invoke-arity-not-pos-int,
                             :err-text "0 is not a valid arity (must be pos-int)!"}],
                   :node-index [2],
                   :op-index [2]}]]],
   :error-text "\nGlobal Operation Tree Errors: \n\t`(invoke> + 0)' at op[2] node[2]:\n\t\t 0 is not a valid arity (must be pos-int)!\n"}]
)
#+end_src

*** DONE <<req-e-11>> *req-e-11*: <pop> is a special operation which removes the top value of the stack
CLOSED: [2022-07-29 Fri 16:01]

#+name: f-req-e-11
#+begin_src clj :exports code
(defstackfn f-req-e-11 [] 1 2 <pop> 3 )
(=> #'user/f-req-e-11 )

(f-req-e-11)
(=> [1 3] )
#+end_src

2 got <pop>'d

