doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html

<div id="outline-container-orge661263" class="outline-4">
<h4 id="orge661263"><span class="done DONE">DONE</span> <a id="org806a413"></a> <b>req-e-08</b>: A function is invoked with "invoke&gt;".</h4>
<div class="outline-text-4" id="text-orge661263">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:56]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orge9167fd">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-08</span> [] <span style="color: #ff7fff;">"string"</span> 42 !v1+ <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span> !v1 (invoke&gt; println 1))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-08 )

(f-req-e-08)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt; 42</span>
(=&gt; [<span style="color: #ff7fff;">"string"</span> 42 <span style="color: #ff7fff;">\z</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">false</span> <span style="color: #34c8d8; font-weight: bold;">nil</span> <span style="color: #34c8d8; font-weight: bold;">:bubba</span> <span style="color: #34c8d8; font-weight: bold;">nil</span>] )
</pre>
</div>
</div>
</div>

<div id="outline-container-org28c2ba7" class="outline-4">
<h4 id="org28c2ba7"><span class="done DONE">DONE</span> <a id="orgd2d7bd5"></a> <b>req-e-09</b>: "invoke&gt;" takes as input the operation</h4>
<div class="outline-text-4" id="text-org28c2ba7">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 15:56]</span></span></p>

<p>
The first argument to <code>invoke&gt;</code> must be a function (in this example <code>+</code>)
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org7d547fc">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-09</span> [!a !b] !a !b (invoke&gt; + 2))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-09 )

(f-req-e-09 2 3)
(=&gt; [5] )

(f-req-e-09 <span style="color: #34c8d8; font-weight: bold;">:foo</span> <span style="color: #ff7fff;">"bar"</span>)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">RUNTIME ERRORS:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `(invoke&gt; + 2)' at op[2] node[2]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              `(apply #'clojure.core/+ ("bar" :foo))' failed during execution (class java.lang.String cannot be cast to class java.lang.Number (java.lang.String and java.lang.Number are in module java.base of loader 'bootstrap'))</span>
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">stackfn-produced-runtime-error</span> )
</pre>
</div>

<p>
The error is not on the function, but on its arguments. I include it to show that '+ became #'clojure.core/+
</p>
</div>
</div>

<div id="outline-container-org1461745" class="outline-4">
<h4 id="org1461745"><span class="done DONE">DONE</span> <a id="orgc6fc088"></a> <b>req-e-10</b>: "invoke&gt;" takes as input the arity to use</h4>
<div class="outline-text-4" id="text-org1461745">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:01]</span></span></p>

<p>
My implementation only accepts pos-int arity, as I understand invoke&gt; to invoke a function on stack values.
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org3f9acd2">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-10</span> [!a !b] !a !b (invoke&gt; + 2))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-10 )

(f-req-e-10 2 3)
(=&gt; [5] )

(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-10*</span> [!a !b] !a !b (invoke&gt; + 0))
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">Global Operation Tree Errors: </span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `(invoke&gt; + 0)' at op[2] node[2]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              0 is not a valid arity (must be pos-int)!</span>
<span style="color: #767283;">;;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">1st Path Errors [&gt;-start-term-&gt;]: </span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `(invoke&gt; + 0)' at op[2] node[2]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              0 is not a valid arity (must be pos-int)!</span>
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">defstackfn-produced-errors</span> )
</pre>
</div>

<p>
Or, if you prefer Exceptions&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org91e033d">(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-10*</span> [!a !b] !a !b (invoke&gt; + 0))
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"defstackfn produced errors"</span>
  {<span style="color: #34c8d8; font-weight: bold;">:error-data</span> [[<span style="color: #ff7fff;">"Global Operation Tree Errors: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=invoke</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> (invoke&gt; + 0),
                       <span style="color: #34c8d8; font-weight: bold;">:fun</span> +,
                       <span style="color: #34c8d8; font-weight: bold;">:arity</span> 0,
                       <span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=tree</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=parse-invoke-arity-not-pos-int</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"0 is not a valid arity (must be pos-int)!"</span>}],
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [2],
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [2]}]]
                    [<span style="color: #ff7fff;">"1st Path Errors [&gt;-start-term-&gt;]: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=invoke</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> (invoke&gt; + 0),
                       <span style="color: #34c8d8; font-weight: bold;">:fun</span> +,
                       <span style="color: #34c8d8; font-weight: bold;">:arity</span> 0,
                       <span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=tree</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=parse-invoke-arity-not-pos-int</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"0 is not a valid arity (must be pos-int)!"</span>}],
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [2],
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [2]}]]],
   <span style="color: #34c8d8; font-weight: bold;">:error-text</span> <span style="color: #ff7fff;">"</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">Global Operation Tree Errors: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`(invoke&gt; + 0)' at op[2] node[2]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> 0 is not a valid arity (must be pos-int)!</span><span style="color: #ffffff; font-weight: bold;">\n\n</span><span style="color: #ff7fff;">1st Path Errors [&gt;-start-term-&gt;]: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`(invoke&gt; + 0)' at op[2] node[2]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> 0 is not a valid arity (must be pos-int)!</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">"</span>}]
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc446cf0" class="outline-4">
<h4 id="orgc446cf0"><span class="done DONE">DONE</span> <a id="orgcbb3b05"></a> <b>req-e-11</b>: &lt;pop&gt; is a special operation which removes the top value of the stack</h4>
<div class="outline-text-4" id="text-orgc446cf0">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:01]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orgfde66e2">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-11</span> [] 1 2 &lt;pop&gt; 3 )
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-11 )

(f-req-e-11)
(=&gt; [1 3] )
</pre>
</div>

<p>
2 got &lt;pop&gt;'d
</p>
</div>
</div>
