doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-e-12>> *req-e-12*: if> tests if the top value of the stack is truthy to determine which branch to follow.
CLOSED: [2022-07-29 Fri 16:02]

#+name: f-req-e-12
#+begin_src clj :exports code
(defstackfn f-req-e-12 [!a] !a (invoke> even? 1) (if> "even" else> "odd"))
(=> #'user/f-req-e-12 )

(f-req-e-12 3)
(=> ["odd"] )

(f-req-e-12 4)
(=> ["even"] )
#+end_src

*** DONE <<req-e-13>> *req-e-13*: The branches of if are separated with "else>"
CLOSED: [2022-07-29 Fri 16:07]

#+name: f-req-e-13
#+begin_src clj :exports code
(defstackfn f-req-e-13 [!a] !a (invoke> even? 1) (if> "even" else> "odd"))
(=> #'user/f-req-e-13 )

(f-req-e-13 3)
(=> ["odd"] )

(f-req-e-13 4)
(=> ["even"] )
#+end_src

Note, my implementation works with a missing ~else>~.

#+name: f-req-e-13*
#+begin_src clj :exports code
(defstackfn f-req-e-13* [!a] !a (invoke> even? 1) (if> "even"))
(=> #'user/f-req-e-13* )

(f-req-e-13* 3)
(=> [] )

(f-req-e-13* 4)
(=> ["even"] )
#+end_src

It works with an empty else>.

#+name: f-req-e-13**
#+begin_src clj :exports code
(defstackfn f-req-e-13** [!a] !a (invoke> even? 1) (if> "even" else>))
(=> #'user/f-req-e-13** )

(f-req-e-13** 3)
(=> [] )

(f-req-e-13** 4)
(=> ["even"] )
#+end_src

It works with an empty then (the ops between the ~if>~ and ~else>~).

#+name: f-req-e-13***
#+begin_src clojure :ns user :results value pp :exports both
(defstackfn f-req-e-13*** [!a] !a (invoke> even? 1) (if> else> "odd"))
(=> #'user/f-req-e-13*** )

(f-req-e-13*** 3)
(=> ["odd"] )

(f-req-e-13*** 4)
(=> [] )
#+end_src

It even works with an empty then and missing else>.

#+name: f-req-e-13****
#+begin_src clj :exports code
(defstackfn f-req-e-13**** [!a] !a (invoke> even? 1) (if>))
(=> #'user/f-req-e-13**** )

(f-req-e-13**** 3)
(=> [] )

(f-req-e-13**** 4)
(=> [] )
    #+end_src
*** DONE <<req-e-14>> *req-e-14*: defstackfn should be a macro
CLOSED: [2022-07-29 Fri 16:08]

#+name: f-req-e-14
#+begin_src clj :exports code
(meta #'defstackfn)
(=>
 {:arglists ([stackfn-sym declarations & operations]),
  :doc "Defines a stack function that takes declaration as its args,
and performs to operations given",
  :line 80,
  :column 1,
  :file "kdh/stax/core.clj",
  :name defstackfn,
  :ns #namespace[kdh.stax.core],
  :macro true}
)
#+end_src

*** DONE <<req-e-15>> *req-e-15*: defstackfn should produce a function invokable like any other function.
CLOSED: [2022-07-29 Fri 16:08]

#+name: f-req-e-15
#+begin_src clj :exports code
(defstackfn f-req-e-15 [!a !b !c] !c !b !a)
(=> #'user/f-req-e-15 )

(f-req-e-15 1 2 3)
(=> [3 2 1] )

(->> [1 2 3 :a :b :c]
	 (partition 3)
	 (map (partial apply f-req-e-15)))
(=> ([3 2 1] [:c :b :a]) )
#+end_src

