doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html

<div id="outline-container-orgb7a83f6" class="outline-4">
<h4 id="orgb7a83f6"><span class="done DONE">DONE</span> <a id="org210e2ce"></a> <b>req-e-12</b>: if&gt; tests if the top value of the stack is truthy to determine which branch to follow.</h4>
<div class="outline-text-4" id="text-orgb7a83f6">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:02]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orgdfdd3ce">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-12</span> [!a] !a (invoke&gt; even? 1) (if&gt; <span style="color: #ff7fff;">"even"</span> else&gt; <span style="color: #ff7fff;">"odd"</span>))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-12 )

(f-req-e-12 3)
(=&gt; [<span style="color: #ff7fff;">"odd"</span>] )

(f-req-e-12 4)
(=&gt; [<span style="color: #ff7fff;">"even"</span>] )
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cf6959" class="outline-4">
<h4 id="org2cf6959"><span class="done DONE">DONE</span> <a id="org99f5c03"></a> <b>req-e-13</b>: The branches of if are separated with "else&gt;"</h4>
<div class="outline-text-4" id="text-org2cf6959">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:07]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="org6181f95">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-13</span> [!a] !a (invoke&gt; even? 1) (if&gt; <span style="color: #ff7fff;">"even"</span> else&gt; <span style="color: #ff7fff;">"odd"</span>))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-13 )

(f-req-e-13 3)
(=&gt; [<span style="color: #ff7fff;">"odd"</span>] )

(f-req-e-13 4)
(=&gt; [<span style="color: #ff7fff;">"even"</span>] )
</pre>
</div>

<p>
Note, my implementation works with a missing <code>else&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgaae3bdd">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-13*</span> [!a] !a (invoke&gt; even? 1) (if&gt; <span style="color: #ff7fff;">"even"</span>))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-13* )

(f-req-e-13* 3)
(=&gt; [] )

(f-req-e-13* 4)
(=&gt; [<span style="color: #ff7fff;">"even"</span>] )
</pre>
</div>

<p>
It works with an empty else&gt;.
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgee94f12">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-13**</span> [!a] !a (invoke&gt; even? 1) (if&gt; <span style="color: #ff7fff;">"even"</span> else&gt;))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-13** )

(f-req-e-13** 3)
(=&gt; [] )

(f-req-e-13** 4)
(=&gt; [<span style="color: #ff7fff;">"even"</span>] )
</pre>
</div>

<p>
It works with an empty then (the ops between the <code>if&gt;</code> and <code>else&gt;</code>).
</p>

<div class="org-src-container">
<pre class="src src-clojure" id="orgead769b">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-13***</span> [!a] !a (invoke&gt; even? 1) (if&gt; else&gt; <span style="color: #ff7fff;">"odd"</span>))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-13*** )

(f-req-e-13*** 3)
(=&gt; [<span style="color: #ff7fff;">"odd"</span>] )

(f-req-e-13*** 4)
(=&gt; [] )
</pre>
</div>

<p>
It even works with an empty then and missing else&gt;.
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org714724e">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-13****</span> [!a] !a (invoke&gt; even? 1) (if&gt;))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-13**** )

(f-req-e-13**** 3)
(=&gt; [] )

(f-req-e-13**** 4)
(=&gt; [] )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeabfb49" class="outline-4">
<h4 id="orgeabfb49"><span class="done DONE">DONE</span> <a id="orgeb3566d"></a> <b>req-e-14</b>: defstackfn should be a macro</h4>
<div class="outline-text-4" id="text-orgeabfb49">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:08]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orgefd03a2">(meta #'defstackfn)
(=&gt;
 {<span style="color: #34c8d8; font-weight: bold;">:arglists</span> ([stackfn-sym declarations &amp; operations]),
  <span style="color: #34c8d8; font-weight: bold;">:doc</span> <span style="color: #ff7fff;">"Defines a stack function that takes declaration as its args,</span>
<span style="color: #ff7fff;">and performs to operations given"</span>,
  <span style="color: #34c8d8; font-weight: bold;">:line</span> 80,
  <span style="color: #34c8d8; font-weight: bold;">:column</span> 1,
  <span style="color: #34c8d8; font-weight: bold;">:file</span> <span style="color: #ff7fff;">"kdh/stax/core.clj"</span>,
  <span style="color: #34c8d8; font-weight: bold;">:name</span> defstackfn,
  <span style="color: #34c8d8; font-weight: bold;">:ns</span> #namespace[kdh.stax.core],
  <span style="color: #34c8d8; font-weight: bold;">:macro</span> <span style="color: #34c8d8; font-weight: bold;">true</span>}
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9a3871" class="outline-4">
<h4 id="orge9a3871"><span class="done DONE">DONE</span> <a id="org7019efd"></a> <b>req-e-15</b>: defstackfn should produce a function invokable like any other function.</h4>
<div class="outline-text-4" id="text-orge9a3871">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:08]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="org0c305f4">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-15</span> [!a !b !c] !c !b !a)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-15 )

(f-req-e-15 1 2 3)

(=&gt; [3 2 1] )

(<span style="color: #ffff0b;">-&gt;&gt;</span> [1 2 3 <span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:c</span>]
         (partition 3)
         (map (partial apply f-req-e-15)))

(=&gt; ([3 2 1] [<span style="color: #34c8d8; font-weight: bold;">:c</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:a</span>]) )
</pre>
</div>
</div>
</div>
