doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-e-16>> *req-e-16*: defstackfn should provide an informative error if there's an invalid stack operation
CLOSED: [2022-07-29 Fri 16:09]

#+name: f-req-e-16
#+begin_src clj :exports code
(defstackfn f-req-e-16 [] true (if> "even" else> else> "odd"))
(=> :kdh.stax.errs/defstackfn-produced-errors )
;;+>
;; Global Operation Tree Errors: 
;; 	`else>' at op[1 3] node[1 :else 0]:
;; 		 else> is not an allowed op
#+end_src

Or, if you prefer Exceptions...

#+name: f-req-e-16-with-exception
#+begin_src clj :exports code
(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (defstackfn f-req-e-16 [] true (if> "even" else> else> "odd"))
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["defstackfn produced errors"
  {:error-data [["Global Operation Tree Errors: "
                 [{:op-type :kdh.stax.node/op=illegal,
                   :op else>,
                   :errors [{:err-zone :kdh.stax.errs/zone=tree,
                             :err-type :kdh.stax.errs/error=parse-illegal-operation,
                             :err-text "else> is not an allowed op"}],
                   :node-index [1 :else 0],
                   :op-index [1 3]}]]],
   :error-text "\nGlobal Operation Tree Errors: \n\t`else>' at op[1 3] node[1 :else 0]:\n\t\t else> is not an allowed op\n"}]
)
#+end_src

*** DONE <<req-e-17>> *req-e-17*: defstackfn should provide an informative error if there's a variable is referenced that doesn't exist.
CLOSED: [2022-07-29 Fri 16:09]

#+name: f-req-e-17
#+begin_src clj :exports code
(defstackfn f-req-e-17 [] true !a)
(=> :kdh.stax.errs/defstackfn-produced-errors )
;;+>
;; 1st Path Errors [>-start-term->]:
;; 	`!a' at op[1] node[1]:
;; 		 !a is a reference before definition
#+end_src

Or, if you prefer Exceptions...

#+name: f-req-e-17-with-exception
#+begin_src clj :exports code
(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (defstackfn f-req-e-17 [] true !a)
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["defstackfn produced errors"
  {:error-data [["1st Path Errors [>-start-term->]: "
		     [{:errors [{:err-zone :kdh.stax.errors/zone=path,
				 :err-type :kdh.stax.errors/error=static-var-not-defined,
				 :err-text "!a is a reference before definition"}],
		       :needs 0,
		       :stack-size 2,
		       :op !a,
		       :node-index [1],
		       :delta 1,
		       :op-index [1],
		       :op-type :kdh.stax.node/op=push-var,
		       :var-ref !a}]]],
   :error-text "\n1st Path Errors [>-start-term->]: \n\t`!a' at op[1] node[1]:\n\t\t !a is a reference before definition\n"}]
)
    #+end_src
