doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html

<div id="outline-container-orgfc55ccd" class="outline-4">
<h4 id="orgfc55ccd"><span class="done DONE">DONE</span> <a id="org4169bab"></a> <b>req-e-16</b>: defstackfn should provide an informative error if there's an invalid stack operation</h4>
<div class="outline-text-4" id="text-orgfc55ccd">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:09]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orge48e48b">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-16</span> [] <span style="color: #34c8d8; font-weight: bold;">true</span> (if&gt; <span style="color: #ff7fff;">"even"</span> else&gt; else&gt; <span style="color: #ff7fff;">"odd"</span>))
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">defstackfn-produced-errors</span> )
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">Global Operation Tree Errors: </span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `else&gt;' at op[1 3] node[1 :else 0]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              else&gt; is not an allowed op</span>
<span style="color: #767283;">;;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">2nd Path Errors [&gt;-start-else-term-&gt;]: </span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `else&gt;' at op[1 3] node[1 :else 0]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              else&gt; is not an allowed op</span>
</pre>
</div>

<p>
Or, if you prefer Exceptions&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clj" id="orgd08d6f0">(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-16</span> [] <span style="color: #34c8d8; font-weight: bold;">true</span> (if&gt; <span style="color: #ff7fff;">"even"</span> else&gt; else&gt; <span style="color: #ff7fff;">"odd"</span>))
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"defstackfn produced errors"</span>
  {<span style="color: #34c8d8; font-weight: bold;">:error-data</span> [[<span style="color: #ff7fff;">"Global Operation Tree Errors: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=illegal</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> else&gt;,
                       <span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=tree</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=parse-illegal-operation</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"else&gt; is not an allowed op"</span>}],
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [1 <span style="color: #34c8d8; font-weight: bold;">:else</span> 0],
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [1 3]}]]
                    [<span style="color: #ff7fff;">"2nd Path Errors [&gt;-start-else-term-&gt;]: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=illegal</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> else&gt;,
                       <span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=tree</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=parse-illegal-operation</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"else&gt; is not an allowed op"</span>}],
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [1 <span style="color: #34c8d8; font-weight: bold;">:else</span> 0],
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [1 3]}]]],
   <span style="color: #34c8d8; font-weight: bold;">:error-text</span> <span style="color: #ff7fff;">"</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">Global Operation Tree Errors: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`else&gt;' at op[1 3] node[1 :else 0]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> else&gt; is not an allowed op</span><span style="color: #ffffff; font-weight: bold;">\n\n</span><span style="color: #ff7fff;">2nd Path Errors [&gt;-start-else-term-&gt;]: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`else&gt;' at op[1 3] node[1 :else 0]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> else&gt; is not an allowed op</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">"</span>}]
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org87d1510" class="outline-4">
<h4 id="org87d1510"><span class="done DONE">DONE</span> <a id="org8c66c16"></a> <b>req-e-17</b>: defstackfn should provide an informative error if there's a variable is referenced that doesn't exist.</h4>
<div class="outline-text-4" id="text-org87d1510">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:09]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orgb1e2298">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-17</span> [] <span style="color: #34c8d8; font-weight: bold;">true</span> !a)
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">defstackfn-produced-errors</span> )
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">1st Path Errors [&gt;-start-term-&gt;]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `!a' at op[1] node[1]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              !a is a reference before definition</span>
</pre>
</div>

<p>
Or, if you prefer Exceptions&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clj" id="org8e3df4b">(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-17</span> [] <span style="color: #34c8d8; font-weight: bold;">true</span> !a)
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"defstackfn produced errors"</span>
  {<span style="color: #34c8d8; font-weight: bold;">:error-data</span> [[<span style="color: #ff7fff;">"1st Path Errors [&gt;-start-term-&gt;]: "</span>
                     [{<span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=path</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errors</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=static-var-not-defined</span>,
                                 <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"!a is a reference before definition"</span>}],
                       <span style="color: #34c8d8; font-weight: bold;">:needs</span> 0,
                       <span style="color: #34c8d8; font-weight: bold;">:stack-size</span> 2,
                       <span style="color: #34c8d8; font-weight: bold;">:op</span> !a,
                       <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [1],
                       <span style="color: #34c8d8; font-weight: bold;">:delta</span> 1,
                       <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [1],
                       <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=push-var</span>,
                       <span style="color: #34c8d8; font-weight: bold;">:var-ref</span> !a}]]],
   <span style="color: #34c8d8; font-weight: bold;">:error-text</span> <span style="color: #ff7fff;">"</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">1st Path Errors [&gt;-start-term-&gt;]: </span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`!a' at op[1] node[1]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> !a is a reference before definition</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">"</span>}]
)
</pre>
</div>
</div>
</div>
