doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-e-18>> *req-e-18*: It should be possible to shadow vars (naming a new local the name of an existing variable).
CLOSED: [2022-07-29 Fri 16:10]

#+name: f-req-e-18
#+begin_src clj :exports code
(defstackfn f-req-e-18 [!a !b] !a true !b !a+ 3 !b+ "help" !a !b)
(=> #'user/f-req-e-18 )

(f-req-e-18 :red :blue)
(=> [:red true :blue 3 "help" :blue 3] )
#+end_src

*** DONE <<req-e-19>> *req-e-19*: The example below contains all functionality you need to implement.
CLOSED: [2022-07-29 Fri 16:10]
This is not a testable requirement, but I will rely on it for justification of implicit requirements
** DONE Implicit requirements (*req-i-#*)
CLOSED: [2022-07-29 Fri 16:14]
Implicit requirements are those not expressed in the explicit requirements, but implied by them or by simple logical extension.
*** DONE <<req-i-01>> *req-i-01*: ~defstackfn~ can take an empty declarations argument
CLOSED: [2022-07-29 Fri 16:10]
#+name: f-req-i-01
#+begin_src clj :exports code
(defstackfn f-req-i-01 [] 1 2 (invoke> + 2))
(=> #'user/f-req-i-01 )

(f-req-i-01)
(=> [3] )
#+end_src
*** DONE <<req-i-02>> *req-i-02*: ~if>~ consumes the top of the stack
CLOSED: [2022-07-29 Fri 16:10]
According to the explicit requirements,
  #+begin_quote
  if> tests if the top value of the stack is truthy to determine which branch to follow. The branches are separated with "else>"
  #+end_quote
However, the example shows the stack as empty on line 14:
#+begin_src clj -n13 :exports code
(invoke> = 2) ; false
(if> ; stack empty
#+end_src
if ~if>~ simply tested the top of the stack without popping, the push of the constant value ~"false!!"~ (line 19) would result in a stack of ~[false "false!!"]~ not ~["false!!"]~ as indicated:
#+begin_src clj -n18 :exports code
else>
 "false!!" ; "false!!"
#+end_src
Therefore, I deduce an implicit requirement that ~if>~ first tests the top value and then pops it from the stack
*** DONE <<req-i-03>> *req-i-03*: ~!v​+~ (define variable and assign it top of stack) does not consume the top of the stack
CLOSED: [2022-07-29 Fri 16:11]
Otherwise the following section of the example would not be correct
+ push of value in stack variable ~!c~ would result in a stack of ~[4]~ if ~!v1+~ consumed to top, but the example shows:
  #+begin_src clj -n5 :exports code
  (invoke> + 2) ; 3
  !v1+ ; 3
  !c ; 3 4
  #+end_src
  ~!v2+~ would leave the stack at ~[3]~ if assignment consumed the top.  This would cause ~(invoke> = 2)~ to fail, as the stack would have would  only one value, but the example shows:
  #+begin_src clj -n11 :exports code
  (invoke> * 2) ; 3 8
  !v2+ ; 3 8
  (invoke> = 2) ; false
  #+end_src
*** DONE <<req-i-04>> *req-i-04*: ~(invoke> fun n)~ applies n items off the top of the stack in stack order (i.e. reverse of underlying vector's order)
CLOSED: [2022-07-29 Fri 16:12]
This is not explicitly stated in the assignment.  And it is not evident in the example, where all invoked functions are either associative functions (~+~, ~*~, and ~=~) with arity=2, or are only given n=1 (e.g. ~println~).  But I find this an implicit requirement of stack logic.  If an invoked function of one argument takes its argument from the top of the stack, then a function of two should take its first from the top, pop the stack, then take its next from the new top.  Internally, this is accomplished with the ~apply~ of the reverse (through ~rseq~) of the ~subvec~ of the last ~n~ items in the stack.
#+name: f-req-i-04
#+begin_src clj :exports code
(defstackfn f-req-i-04 [] 1 2 3 4 (invoke> println 4))
(=> #'user/f-req-i-04 )

(f-req-i-04)
;;+> 4 3 2 1
#+end_src
