doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html
<div id="outline-container-org6644bf3" class="outline-4">
<h4 id="org6644bf3"><span class="done DONE">DONE</span> <a id="orgb2a1757"></a> <b>req-e-18</b>: It should be possible to shadow vars (naming a new local the name of an existing variable).</h4>
<div class="outline-text-4" id="text-org6644bf3">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:10]</span></span></p>

<div class="org-src-container">
<pre class="src src-clj" id="orgd04b302">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-e-18</span> [!a !b] !a <span style="color: #34c8d8; font-weight: bold;">true</span> !b !a+ 3 !b+ <span style="color: #ff7fff;">"help"</span> !a !b)
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-e-18 )

(f-req-e-18 <span style="color: #34c8d8; font-weight: bold;">:red</span> <span style="color: #34c8d8; font-weight: bold;">:blue</span>)
(=&gt; [<span style="color: #34c8d8; font-weight: bold;">:red</span> <span style="color: #34c8d8; font-weight: bold;">true</span> <span style="color: #34c8d8; font-weight: bold;">:blue</span> 3 <span style="color: #ff7fff;">"help"</span> <span style="color: #34c8d8; font-weight: bold;">:blue</span> 3] )
</pre>
</div>
</div>
</div>

<div id="outline-container-org47b36cb" class="outline-4">
<h4 id="org47b36cb"><span class="done DONE">DONE</span> <a id="org50d81e5"></a> <b>req-e-19</b>: The example below contains all functionality you need to implement.</h4>
<div class="outline-text-4" id="text-org47b36cb">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:10]</span></span></p>
<p>
This is not a testable requirement, but I will rely on it for justification of implicit requirements
</p>
</div>
</div>
</div>
<div id="outline-container-org68fd779" class="outline-3">
<h3 id="org68fd779"><span class="done DONE">DONE</span> Implicit requirements (<b>req-i-#</b>)</h3>
<div class="outline-text-3" id="text-org68fd779">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:14]</span></span></p>
<p>
Implicit requirements are those not expressed in the explicit requirements, but implied by them or by simple logical extension.
</p>
</div>
<div id="outline-container-org304409c" class="outline-4">
<h4 id="org304409c"><span class="done DONE">DONE</span> <a id="org9a6c282"></a> <b>req-i-01</b>: <code>defstackfn</code> can take an empty declarations argument</h4>
<div class="outline-text-4" id="text-org304409c">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:10]</span></span></p>
<div class="org-src-container">
<pre class="src src-clj" id="org81025e2">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-i-01</span> [] 1 2 (invoke&gt; + 2))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-i-01 )

(f-req-i-01)
(=&gt; [3] )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd910c6c" class="outline-4">
<h4 id="orgd910c6c"><span class="done DONE">DONE</span> <a id="org70cd157"></a> <b>req-i-02</b>: <code>if&gt;</code> consumes the top of the stack</h4>
<div class="outline-text-4" id="text-orgd910c6c">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:10]</span></span></p>
<p>
According to the explicit requirements,
</p>
<blockquote>
<p>
if&gt; tests if the top value of the stack is truthy to determine which branch to follow. The branches are separated with "else&gt;"
</p>
</blockquote>
<p>
However, the example shows the stack as empty on line 14:
</p>
<div class="org-src-container">
<pre class="src src-clj"><span class="linenr">13: </span>(invoke&gt; = 2) <span style="color: #767283; font-style: italic;">; false</span>
<span class="linenr">14: </span>(if&gt; <span style="color: #767283; font-style: italic;">; stack empty</span>
</pre>
</div>
<p>
if <code>if&gt;</code> simply tested the top of the stack without popping, the push of the constant value <code>"false!!"</code> (line 19) would result in a stack of <code>[false "false!!"]</code> not <code>["false!!"]</code> as indicated:
</p>
<div class="org-src-container">
<pre class="src src-clj"><span class="linenr">18: </span>else&gt;
<span class="linenr">19: </span> <span style="color: #ff7fff;">"false!!"</span> <span style="color: #767283; font-style: italic;">; "false!!"</span>
</pre>
</div>
<p>
Therefore, I deduce an implicit requirement that <code>if&gt;</code> first tests the top value and then pops it from the stack
</p>
</div>
</div>
<div id="outline-container-org882b0bd" class="outline-4">
<h4 id="org882b0bd"><span class="done DONE">DONE</span> <a id="org00f0195"></a> <b>req-i-03</b>: <code>!v​+</code> (define variable and assign it top of stack) does not consume the top of the stack</h4>
<div class="outline-text-4" id="text-org882b0bd">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:11]</span></span></p>
<p>
Otherwise the following section of the example would not be correct
</p>
<ul class="org-ul">
<li><p>
push of value in stack variable <code>!c</code> would result in a stack of <code>[4]</code> if <code>!v1+</code> consumed to top, but the example shows:
</p>
<div class="org-src-container">
<pre class="src src-clj"><span class="linenr">5: </span>(invoke&gt; + 2) <span style="color: #767283; font-style: italic;">; 3</span>
<span class="linenr">6: </span>!v1+ <span style="color: #767283; font-style: italic;">; 3</span>
<span class="linenr">7: </span>!c <span style="color: #767283; font-style: italic;">; 3 4</span>
</pre>
</div>
<p>
<code>!v2+</code> would leave the stack at <code>[3]</code> if assignment consumed the top.  This would cause <code>(invoke&gt; = 2)</code> to fail, as the stack would have would  only one value, but the example shows:
</p>
<div class="org-src-container">
<pre class="src src-clj"><span class="linenr">11: </span>(invoke&gt; * 2) <span style="color: #767283; font-style: italic;">; 3 8</span>
<span class="linenr">12: </span>!v2+ <span style="color: #767283; font-style: italic;">; 3 8</span>
<span class="linenr">13: </span>(invoke&gt; = 2) <span style="color: #767283; font-style: italic;">; false</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgbf585b9" class="outline-4">
<h4 id="orgbf585b9"><span class="done DONE">DONE</span> <a id="org666916a"></a> <b>req-i-04</b>: <code>(invoke&gt; fun n)</code> applies n items off the top of the stack in stack order (i.e. reverse of underlying vector's order)</h4>
<div class="outline-text-4" id="text-orgbf585b9">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:12]</span></span></p>
<p>
This is not explicitly stated in the assignment.  And it is not evident in the example, where all invoked functions are either associative functions (<code>+</code>, <code>*</code>, and <code>=</code>) with arity=2, or are only given n=1 (e.g. <code>println</code>).  But I find this an implicit requirement of stack logic.  If an invoked function of one argument takes its argument from the top of the stack, then a function of two should take its first from the top, pop the stack, then take its next from the new top.  Internally, this is accomplished with the <code>apply</code> of the reverse (through <code>rseq</code>) of the <code>subvec</code> of the last <code>n</code> items in the stack.
</p>
<div class="org-src-container">
<pre class="src src-clj" id="org19fc016">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-i-04</span> [] 1 2 3 4 (invoke&gt; println 4))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-i-04 )

(f-req-i-04)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt; 4 3 2 1</span>
</pre>
</div>
</div>
</div>
