doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-i-05>> *req-i-05*: ~(invoke> fun n)~ for the sake of consistency, the return value of invoke should be /constant/ (i.e. self-evaluating)
CLOSED: [2022-07-29 Fri 16:12]
#+name: f-req-i-05
#+begin_src clj
(defstackfn f-req-i-05 [!a !b !c] !a !b !c (invoke> vector 3))
(=> #'user/f-req-i-05 )


(f-req-i-05 1 2 3)
;;+>
;; RUNTIME ERRORS:
;; 	`(invoke> vector 3)' at op[3] node[3]:
;; 		 `(apply #'clojure.core/vector (3 2 1))' => `[3 2 1]' with *stax-require-simple-stack-values* = true
(=> :kdh.stax.errs/stackfn-produced-runtime-error )

(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (f-req-i-05 1 2 3)
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["Runtime Errors" {:error-text "\nRUNTIME ERRORS:\n\t`(invoke> vector 3)' at op[3] node[3]:\n\t\t `(apply #'clojure.core/vector (3 2 1))' => `[3 2 1]' with *stax-require-simple-stack-values* = true\n",
			:error-data [["RUNTIME ERRORS:"
				      [{:errors [{:err-zone :kdh.stax.errs/zone=exec,
						  :err-type :kdh.stax.errs/error=runtime-invoke-returned-complex-val,
						  :err-text "`(apply #'clojure.core/vector (3 2 1))' => `[3 2 1]' with *stax-require-simple-stack-values* = true"}],
					:invoke-val [3 2 1],
					:needs 3,
					:fun vector,
					:turns ["start"],
					:invoke-args (3 2 1),
					:trace [{:needs 0,
						 :dot-opts {:shape :point},
						 :op <<start>>,
						 :node-index [],
						 :delta 0,
						 :stack [],
						 :op-index [],
						 :branch :start,
						 :var-map {!a 1,
							   !b 2,
							   !c 3},
						 :op-type :kdh.stax.node/op=start}
						{:needs 0,
						 :op !a,
						 :node-index [0],
						 :delta 1,
						 :stack [1],
						 :op-index [0],
						 :var-map {!a 1,
							   !b 2,
							   !c 3},
						 :op-type :kdh.stax.node/op=push-var,
						 :var-ref !a}
						{:needs 0,
						 :op !b,
						 :node-index [1],
						 :delta 1,
						 :stack [1 2],
						 :op-index [1],
						 :var-map {!a 1,
							   !b 2,
							   !c 3},
						 :op-type :kdh.stax.node/op=push-var,
						 :var-ref !b}
						{:needs 0,
						 :op !c,
						 :node-index [2],
						 :delta 1,
						 :stack [1 2 3],
						 :op-index [2],
						 :var-map {!a 1,
							   !b 2,
							   !c 3},
						 :op-type :kdh.stax.node/op=push-var,
						 :var-ref !c}
						{:errors [{:err-zone :kdh.stax.errs/zone=exec,
							   :err-type :kdh.stax.errs/error=runtime-invoke-returned-complex-val,
							   :err-text "`(apply #'clojure.core/vector (3 2 1))' => `[3 2 1]' with *stax-require-simple-stack-values* = true"}],
						 :invoke-val [3 2 1],
						 :needs 3,
						 :fun vector,
						 :invoke-args (3 2 1),
						 :invoke-apply (apply #'clojure.core/vector (3 2 1)),
						 :op (invoke> vector 3),
						 :invoke-fn #'clojure.core/vector,
						 :node-index [3],
						 :delta -2,
						 :arity 3,
						 :op-index [3],
						 :op-type :kdh.stax.node/op=invoke}],
					:invoke-apply (apply #'clojure.core/vector (3 2 1)),
					:op (invoke> vector 3),
					:invoke-fn #'clojure.core/vector,
					:var-init-map {!a 1,
						       !b 2,
						       !c 3},
					:node-index [3],
					:delta -2,
					:arity 3,
					:op-index [3],
					:op-type :kdh.stax.node/op=invoke}]]]}]
)
#+end_src
