doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html
<div id="outline-container-org29a3bee" class="outline-4">
<h4 id="org29a3bee"><span class="done DONE">DONE</span> <a id="org8137df9"></a> <b>req-i-05</b>: <code>(invoke&gt; fun n)</code> for the sake of consistency, the return value of invoke should be <i>constant</i> (i.e. self-evaluating)</h4>
<div class="outline-text-4" id="text-org29a3bee">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:12]</span></span></p>
<div class="org-src-container">
<pre class="src src-clj" id="org98c4410">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-i-05</span> [!a !b !c] !a !b !c (invoke&gt; vector 3))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-i-05 )


(f-req-i-05 1 2 3)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt;</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">RUNTIME ERRORS:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">     `(invoke&gt; vector 3)' at op[3] node[3]:</span>
<span style="color: #767283;">;; </span><span style="color: #767283; font-style: italic;">              `(apply #'clojure.core/vector (3 2 1))' =&gt; `[3 2 1]' with *stax-require-simple-stack-values* = true</span>
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">stackfn-produced-runtime-error</span> )

(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (f-req-i-05 1 2 3)
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"Runtime Errors"</span> {<span style="color: #34c8d8; font-weight: bold;">:error-text</span> <span style="color: #ff7fff;">"</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">RUNTIME ERRORS:</span><span style="color: #ffffff; font-weight: bold;">\n\t</span><span style="color: #ff7fff;">`(invoke&gt; vector 3)' at op[3] node[3]:</span><span style="color: #ffffff; font-weight: bold;">\n\t\t</span><span style="color: #ff7fff;"> `(apply #'clojure.core/vector (3 2 1))' =&gt; `[3 2 1]' with *stax-require-simple-stack-values* = true</span><span style="color: #ffffff; font-weight: bold;">\n</span><span style="color: #ff7fff;">"</span>,
                        <span style="color: #34c8d8; font-weight: bold;">:error-data</span> [[<span style="color: #ff7fff;">"RUNTIME ERRORS:"</span>
                                      [{<span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=exec</span>,
                                                  <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=runtime-invoke-returned-complex-val</span>,
                                                  <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"`(apply #'clojure.core/vector (3 2 1))' =&gt; `[3 2 1]' with *stax-require-simple-stack-values* = true"</span>}],
                                        <span style="color: #34c8d8; font-weight: bold;">:invoke-val</span> [3 2 1],
                                        <span style="color: #34c8d8; font-weight: bold;">:needs</span> 3,
                                        <span style="color: #34c8d8; font-weight: bold;">:fun</span> vector,
                                        <span style="color: #34c8d8; font-weight: bold;">:turns</span> [<span style="color: #ff7fff;">"start"</span>],
                                        <span style="color: #34c8d8; font-weight: bold;">:invoke-args</span> (3 2 1),
                                        <span style="color: #34c8d8; font-weight: bold;">:trace</span> [{<span style="color: #34c8d8; font-weight: bold;">:needs</span> 0,
                                                 <span style="color: #34c8d8; font-weight: bold;">:dot-opts</span> {<span style="color: #34c8d8; font-weight: bold;">:shape</span> <span style="color: #34c8d8; font-weight: bold;">:point</span>},
                                                 <span style="color: #34c8d8; font-weight: bold;">:op</span> &lt;&lt;start&gt;&gt;,
                                                 <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [],
                                                 <span style="color: #34c8d8; font-weight: bold;">:delta</span> 0,
                                                 <span style="color: #34c8d8; font-weight: bold;">:stack</span> [],
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [],
                                                 <span style="color: #34c8d8; font-weight: bold;">:branch</span> <span style="color: #34c8d8; font-weight: bold;">:start</span>,
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-map</span> {!a 1,
                                                           !b 2,
                                                           !c 3},
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=start</span>}
                                                {<span style="color: #34c8d8; font-weight: bold;">:needs</span> 0,
                                                 <span style="color: #34c8d8; font-weight: bold;">:op</span> !a,
                                                 <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [0],
                                                 <span style="color: #34c8d8; font-weight: bold;">:delta</span> 1,
                                                 <span style="color: #34c8d8; font-weight: bold;">:stack</span> [1],
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [0],
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-map</span> {!a 1,
                                                           !b 2,
                                                           !c 3},
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=push-var</span>,
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-ref</span> !a}
                                                {<span style="color: #34c8d8; font-weight: bold;">:needs</span> 0,
                                                 <span style="color: #34c8d8; font-weight: bold;">:op</span> !b,
                                                 <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [1],
                                                 <span style="color: #34c8d8; font-weight: bold;">:delta</span> 1,
                                                 <span style="color: #34c8d8; font-weight: bold;">:stack</span> [1 2],
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [1],
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-map</span> {!a 1,
                                                           !b 2,
                                                           !c 3},
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=push-var</span>,
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-ref</span> !b}
                                                {<span style="color: #34c8d8; font-weight: bold;">:needs</span> 0,
                                                 <span style="color: #34c8d8; font-weight: bold;">:op</span> !c,
                                                 <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [2],
                                                 <span style="color: #34c8d8; font-weight: bold;">:delta</span> 1,
                                                 <span style="color: #34c8d8; font-weight: bold;">:stack</span> [1 2 3],
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [2],
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-map</span> {!a 1,
                                                           !b 2,
                                                           !c 3},
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=push-var</span>,
                                                 <span style="color: #34c8d8; font-weight: bold;">:var-ref</span> !c}
                                                {<span style="color: #34c8d8; font-weight: bold;">:errors</span> [{<span style="color: #34c8d8; font-weight: bold;">:err-zone</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">zone=exec</span>,
                                                           <span style="color: #34c8d8; font-weight: bold;">:err-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">error=runtime-invoke-returned-complex-val</span>,
                                                           <span style="color: #34c8d8; font-weight: bold;">:err-text</span> <span style="color: #ff7fff;">"`(apply #'clojure.core/vector (3 2 1))' =&gt; `[3 2 1]' with *stax-require-simple-stack-values* = true"</span>}],
                                                 <span style="color: #34c8d8; font-weight: bold;">:invoke-val</span> [3 2 1],
                                                 <span style="color: #34c8d8; font-weight: bold;">:needs</span> 3,
                                                 <span style="color: #34c8d8; font-weight: bold;">:fun</span> vector,
                                                 <span style="color: #34c8d8; font-weight: bold;">:invoke-args</span> (3 2 1),
                                                 <span style="color: #34c8d8; font-weight: bold;">:invoke-apply</span> (apply <span style="color: #9fcb66;">#'clojure.core</span>/vector (3 2 1)),
                                                 <span style="color: #34c8d8; font-weight: bold;">:op</span> (invoke&gt; vector 3),
                                                 <span style="color: #34c8d8; font-weight: bold;">:invoke-fn</span> <span style="color: #9fcb66;">#'clojure.core</span>/vector,
                                                 <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [3],
                                                 <span style="color: #34c8d8; font-weight: bold;">:delta</span> -2,
                                                 <span style="color: #34c8d8; font-weight: bold;">:arity</span> 3,
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [3],
                                                 <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=invoke</span>}],
                                        <span style="color: #34c8d8; font-weight: bold;">:invoke-apply</span> (apply <span style="color: #9fcb66;">#'clojure.core</span>/vector (3 2 1)),
                                        <span style="color: #34c8d8; font-weight: bold;">:op</span> (invoke&gt; vector 3),
                                        <span style="color: #34c8d8; font-weight: bold;">:invoke-fn</span> <span style="color: #9fcb66;">#'clojure.core</span>/vector,
                                        <span style="color: #34c8d8; font-weight: bold;">:var-init-map</span> {!a 1,
                                                       !b 2,
                                                       !c 3},
                                        <span style="color: #34c8d8; font-weight: bold;">:node-index</span> [3],
                                        <span style="color: #34c8d8; font-weight: bold;">:delta</span> -2,
                                        <span style="color: #34c8d8; font-weight: bold;">:arity</span> 3,
                                        <span style="color: #34c8d8; font-weight: bold;">:op-index</span> [3],
                                        <span style="color: #34c8d8; font-weight: bold;">:op-type</span> <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.node</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">op=invoke</span>}]]]}]
)
</pre>
</div>
</div>
</div>
