doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
*** DONE <<req-i-06>> *req-i-06*: For the sake of consistency, values passed to the defstackfn defined function should be /constant/ (i.e. self-evaluating)
CLOSED: [2022-07-29 Fri 16:13]
#+name: f-req-i-06
#+begin_src clj
(defstackfn f-req-i-05 [!a !b !c] !a !b !c (invoke> println 3))
(=> #'user/f-req-i-05 )


(f-req-i-05 1 [:a :b :c] 3)
;;+> Complex args are forbidden: arg#1:[:a :b :c]
(=> :kdh.stax.errs/stackfn-complex-args-forbidden )

(binding [kdh.stax.errs/*stax-throw-on-error* true]
  (try (f-req-i-05 1 [:a :b :b] 3)
	   (catch Exception e [(ex-message e)
			       (ex-data e)])))
(=>
 ["Complex args are forbidden: arg#1:[:a :b :b]"
  {:complex-args ([1 [:a :b :b]])}]
  )
#+end_src    
*** DONE <<req-i-07>> *req-i-07*: ~kdh.stax.core/defstackfn~ creates a named function that returns the remaining stack as a vector
CLOSED: [2022-07-29 Fri 16:14]
    Internally, I represent the stack as a vector whose rightmost value is its top.  This choice is idiomatic because ~clojure.core/pop~ of a vector returns a vector like it's argument, but without the last item. I note that none of the stack state comments in the given example show any enclosing structure.  And they all treat the right-most as the top.  Of course, there is nothing preventing the choice of a list or queue, as pop works on those. It is just my reasoned and experience choice to use a vector.
    
    Further, I return the stack and not its top because that would destroy important information (the rest of the stack).  As a general principle, I do not believe in descarding valid data -- the final state of the stack is useful in debugging.  And if the user wishes to only have the top, they can always peek it.  If I only return the top, however, the user cannot access (or even be aware of) the remaining discarded stack.
* Environment
