doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html
<div id="outline-container-orgafdb022" class="outline-4">
<h4 id="orgafdb022"><span class="done DONE">DONE</span> <a id="org9d06e74"></a> <b>req-i-06</b>: For the sake of consistency, values passed to the defstackfn defined function should be <i>constant</i> (i.e. self-evaluating)</h4>
<div class="outline-text-4" id="text-orgafdb022">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:13]</span></span></p>
<div class="org-src-container">
<pre class="src src-clj" id="orge072407">(<span style="color: #ffff0b;">defstackfn</span> <span style="color: #ff996f;">f-req-i-05</span> [!a !b !c] !a !b !c (invoke&gt; println 3))
(=&gt; <span style="color: #9fcb66;">#'user</span>/f-req-i-05 )


(f-req-i-05 1 [<span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:c</span>] 3)
<span style="color: #767283;">;;</span><span style="color: #767283; font-style: italic;">+&gt; Complex args are forbidden: arg#1:[:a :b :c]</span>
(=&gt; <span style="color: #34c8d8; font-weight: bold;">:</span><span style="color: #9fcb66;">kdh.stax.errs</span><span style="color: #cfccd2; background-color: #25202a;">/</span><span style="color: #34c8d8; font-weight: bold;">stackfn-complex-args-forbidden</span> )

(<span style="color: #ffff0b;">binding</span> [<span style="color: #9fcb66;">kdh.stax.errs</span>/<span style="color: #4ac964;">*stax-throw-on-error*</span> <span style="color: #34c8d8; font-weight: bold;">true</span>]
  (<span style="color: #ffff0b;">try</span> (f-req-i-05 1 [<span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:b</span>] 3)
           (<span style="color: #ffff0b;">catch</span> Exception e [(ex-message e)
                               (ex-data e)])))
(=&gt;
 [<span style="color: #ff7fff;">"Complex args are forbidden: arg#1:[:a :b :b]"</span>
  {<span style="color: #34c8d8; font-weight: bold;">:complex-args</span> ([1 [<span style="color: #34c8d8; font-weight: bold;">:a</span> <span style="color: #34c8d8; font-weight: bold;">:b</span> <span style="color: #34c8d8; font-weight: bold;">:b</span>]])}]
  )
</pre>
</div>
</div>
</div>
<div id="outline-container-org20e3404" class="outline-4">
<h4 id="org20e3404"><span class="done DONE">DONE</span> <a id="org4951fa1"></a> <b>req-i-07</b>: <code>kdh.stax.core/defstackfn</code> creates a named function that returns the remaining stack as a vector</h4>
<div class="outline-text-4" id="text-org20e3404">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2022-07-29 Fri 16:14]</span></span></p>
<p>
Internally, I represent the stack as a vector whose rightmost value is its top.  This choice is idiomatic because <code>clojure.core/pop</code> of a vector returns a vector like it's argument, but without the last item. I note that none of the stack state comments in the given example show any enclosing structure.  And they all treat the right-most as the top.  Of course, there is nothing preventing the choice of a list or queue, as pop works on those. It is just my reasoned and experience choice to use a vector.
</p>

<p>
Further, I return the stack and not its top because that would destroy important information (the rest of the stack).  As a general principle, I do not believe in descarding valid data &#x2013; the final state of the stack is useful in debugging.  And if the user wishes to only have the top, they can always peek it.  If I only return the top, however, the user cannot access (or even be aware of) the remaining discarded stack.
</p>
</div>
</div>
</div>
</div>
