doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.org
** Java Properties
#+name: java-properties
#+begin_src clojure :ns stax-user.core :results value table :exports results
(->> (System/getProperties)
     seq
     (partition 2)
     (into {})
     (#(dissoc % "java.class.path"))
     (map-vals #(str/replace % "_" "​_"))
     (sort-by #(-> % first (str/split #"\.")) sequential-compare))
#+end_src

#+RESULTS: java-properties
| awt.toolkit                   | sun.awt.X11.XToolkit                                                                                                                                                                                                                                                                                                                                                                                                          |
| clojure.compile.path          | /mnt/e/Sync/Clojure/rpl/stax-deploy/doc/user-testing/stax-user-clj-1-9-0/target/classes                                                                                                                                                                                                                                                                                                                                       |
| clojure.debug                 | false                                                                                                                                                                                                                                                                                                                                                                                                                         |
| file.encoding                 | UTF-8                                                                                                                                                                                                                                                                                                                                                                                                                         |
| file.encoding.pkg             | sun.io                                                                                                                                                                                                                                                                                                                                                                                                                        |
| file.separator                | /                                                                                                                                                                                                                                                                                                                                                                                                                             |
| java.awt.graphicsenv          | sun.awt.X11GraphicsEnvironment                                                                                                                                                                                                                                                                                                                                                                                                |
| java.awt.printerjob           | sun.print.PSPrinterJob                                                                                                                                                                                                                                                                                                                                                                                                        |
| java.class.version            | 52.0                                                                                                                                                                                                                                                                                                                                                                                                                          |
| java.endorsed.dirs            | /usr/lib/jvm/java-8-openjdk-amd64/jre/lib/endorsed                                                                                                                                                                                                                                                                                                                                                                            |
| java.ext.dirs                 | /usr/lib/jvm/java-8-openjdk-amd64/jre/lib/ext:/usr/java/packages/lib/ext                                                                                                                                                                                                                                                                                                                                                      |
| java.home                     | /usr/lib/jvm/java-8-openjdk-amd64/jre                                                                                                                                                                                                                                                                                                                                                                                         |
| java.io.tmpdir                | /tmp                                                                                                                                                                                                                                                                                                                                                                                                                          |
| java.library.path             | /usr/java/packages/lib/amd64:/usr/lib/x86​_64-linux-gnu/jni:/lib/x86​_64-linux-gnu:/usr/lib/x86​_64-linux-gnu:/usr/lib/jni:/lib:/usr/lib                                                                                                                                                                                                                                                                                         |
| java.runtime.name             | OpenJDK Runtime Environment                                                                                                                                                                                                                                                                                                                                                                                                   |
| java.runtime.version          | 1.8.0​_312-8u312-b07-0ubuntu1~20.04-b07                                                                                                                                                                                                                                                                                                                                                                                        |
| java.specification.name       | Java Platform API Specification                                                                                                                                                                                                                                                                                                                                                                                               |
| java.specification.vendor     | Oracle Corporation                                                                                                                                                                                                                                                                                                                                                                                                            |
| java.specification.version    | 1.8                                                                                                                                                                                                                                                                                                                                                                                                                           |
| java.vendor                   | Private Build                                                                                                                                                                                                                                                                                                                                                                                                                 |
| java.vendor.url               | http://java.oracle.com/                                                                                                                                                                                                                                                                                                                                                                                                       |
| java.vendor.url.bug           | http://bugreport.sun.com/bugreport/                                                                                                                                                                                                                                                                                                                                                                                           |
| java.version                  | 1.8.0​_312                                                                                                                                                                                                                                                                                                                                                                                                                     |
| java.vm.info                  | mixed mode                                                                                                                                                                                                                                                                                                                                                                                                                    |
| java.vm.name                  | OpenJDK 64-Bit Server VM                                                                                                                                                                                                                                                                                                                                                                                                      |
| java.vm.specification.name    | Java Virtual Machine Specification                                                                                                                                                                                                                                                                                                                                                                                            |
| java.vm.specification.vendor  | Oracle Corporation                                                                                                                                                                                                                                                                                                                                                                                                            |
| java.vm.specification.version | 1.8                                                                                                                                                                                                                                                                                                                                                                                                                           |
| java.vm.vendor                | Private Build                                                                                                                                                                                                                                                                                                                                                                                                                 |
| java.vm.version               | 25.312-b07                                                                                                                                                                                                                                                                                                                                                                                                                    |
| line.separator                | \n                                                                                                                                                                                                                                                                                                                                                                                                                            |
| os.arch                       | amd64                                                                                                                                                                                                                                                                                                                                                                                                                         |
| os.name                       | Linux                                                                                                                                                                                                                                                                                                                                                                                                                         |
| os.version                    | 5.10.102.1-microsoft-standard-WSL2                                                                                                                                                                                                                                                                                                                                                                                            |
| path.separator                | :                                                                                                                                                                                                                                                                                                                                                                                                                             |
| stax-user.version             | 0.1.0-SNAPSHOT                                                                                                                                                                                                                                                                                                                                                                                                                |
| sun.arch.data.model           | 64                                                                                                                                                                                                                                                                                                                                                                                                                            |
| sun.boot.class.path           | /usr/lib/jvm/java-8-openjdk-amd64/jre/lib/resources.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/rt.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/sunrsasign.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/jsse.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/jce.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/charsets.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/lib/jfr.jar:/usr/lib/jvm/java-8-openjdk-amd64/jre/classes |
| sun.boot.library.path         | /usr/lib/jvm/java-8-openjdk-amd64/jre/lib/amd64                                                                                                                                                                                                                                                                                                                                                                               |
| sun.cpu.endian                | little                                                                                                                                                                                                                                                                                                                                                                                                                        |
| sun.io.unicode.encoding       | UnicodeLittle                                                                                                                                                                                                                                                                                                                                                                                                                 |
| sun.java.command              | clojure.main -i /tmp/form-init8395309977680219555.clj                                                                                                                                                                                                                                                                                                                                                                         |
| sun.java.launcher             | SUN​_STANDARD                                                                                                                                                                                                                                                                                                                                                                                                                  |
| sun.jnu.encoding              | UTF-8                                                                                                                                                                                                                                                                                                                                                                                                                         |
| sun.management.compiler       | HotSpot 64-Bit Tiered Compilers                                                                                                                                                                                                                                                                                                                                                                                               |
| sun.os.patch.level            | unknown                                                                                                                                                                                                                                                                                                                                                                                                                       |
| user.dir                      | /mnt/e/Sync/Clojure/rpl/stax-deploy/doc/user-testing/stax-user-clj-1-9-0                                                                                                                                                                                                                                                                                                                                                      |
| user.home                     | /home/keith                                                                                                                                                                                                                                                                                                                                                                                                                   |
| user.language                 | en                                                                                                                                                                                                                                                                                                                                                                                                                            |
| user.name                     | keith                                                                                                                                                                                                                                                                                                                                                                                                                         |
| user.timezone                 | America/New​_York                                                                                                                                                                                                                                                                                                                                                                                                              |

