doc/user-testing/stax-user-clj-1-9-0/doc/user-test-clojure-1-9-0.html

<div id="outline-container-orgfd96a20" class="outline-3">
<h3 id="orgfd96a20">Java Class Path</h3>
<div class="outline-text-3" id="text-orgfd96a20">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">/mnt/e/Sync/Clojure/rpl/stax-user-clj-1-9-0/test</td>
</tr>

<tr>
<td class="org-left">/mnt/e/Sync/Clojure/rpl/stax-user-clj-1-9-0/src</td>
</tr>

<tr>
<td class="org-left">/mnt/e/Sync/Clojure/rpl/stax-user-clj-1-9-0/dev-resources</td>
</tr>

<tr>
<td class="org-left">/mnt/e/Sync/Clojure/rpl/stax-user-clj-1-9-0/resources</td>
</tr>

<tr>
<td class="org-left">/mnt/e/Sync/Clojure/rpl/stax-user-clj-1-9-0/target/classes</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/djblue/portal/0.28.0/portal-0.28.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/fasterxml/jackson/core/jackson-core/2.8.7/jackson-core-2.8.7.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-model-builder/3.5.3/maven-model-builder-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-builder-support/3.5.3/maven-builder-support-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/nrepl/incomplete/0.1.0/incomplete-0.1.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/msgpack/msgpack/0.6.12/msgpack-0.6.12.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/httpcomponents/httpclient/4.5.3/httpclient-4.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/commons-io/commons-io/2.5/commons-io-2.5.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-model/3.5.3/maven-model-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-transport-wagon/1.0.3/maven-resolver-transport-wagon-1.0.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/criterium/criterium/0.4.4/criterium-0.4.4.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/cognitect/transit-java/1.0.362/transit-java-1.0.362.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-util/1.1.1/maven-resolver-util-1.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/rpl/specter/1.1.4/specter-1.1.4.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/data.xml/0.0.8/data.xml-0.0.8.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/google/guava/guava/20.0/guava-20.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-repository-metadata/3.5.3/maven-repository-metadata-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/javax/xml/bind/jaxb-api/2.3.0/jaxb-api-2.3.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-resolver-provider/3.5.3/maven-resolver-provider-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/codehaus/plexus/plexus-utils/3.1.0/plexus-utils-3.1.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/wagon/wagon-provider-api/3.0.0/wagon-provider-api-3.0.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/fipp/fipp/0.6.23/fipp-0.6.23.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/wagon/wagon-http/3.0.0/wagon-http-3.0.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/net/cgrand/macrovich/0.2.1/macrovich-0.2.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/cognitect/transit-js/0.8.874/transit-js-0.8.874.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/mvxcvi/arrangement/1.2.0/arrangement-1.2.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-api/1.1.1/maven-resolver-api-1.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/codehaus/plexus/plexus-component-annotations/1.7.1/plexus-component-annotations-1.7.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/rewrite-clj/rewrite-clj/0.6.1/rewrite-clj-0.6.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/kdh/stax/0.1.0/stax-0.1.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-transport-http/1.0.3/maven-resolver-transport-http-1.0.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/zprint/zprint/1.1.1/zprint-1.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-connector-basic/1.0.3/maven-resolver-connector-basic-1.0.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/core.rrb-vector/0.1.2/core.rrb-vector-0.1.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-spi/1.1.1/maven-resolver-spi-1.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/mvxcvi/puget/1.3.1/puget-1.3.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/tcrawley/dynapath/1.0.0/dynapath-1.0.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/httpcomponents/httpcore/4.4.6/httpcore-4.4.6.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/macroz/tangle/0.2.2/tangle-0.2.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/rewrite-cljs/rewrite-cljs/0.4.5/rewrite-cljs-0.4.5.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/borkdude/sci/0.2.1-alpha.1/sci-0.2.1-alpha.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/clojure/1.9.0/clojure-1.9.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/jsoup/jsoup/1.7.2/jsoup-1.7.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/googlecode/json-simple/json-simple/1.1.1/json-simple-1.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/hiccup/hiccup/1.0.5/hiccup-1.0.5.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/nrepl/nrepl/0.8.3/nrepl-0.8.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/clj-tuple/clj-tuple/0.2.2/clj-tuple-0.2.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/flatland/ordered/1.5.7/ordered-1.5.7.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/javax/inject/javax.inject/1/javax.inject-1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/flatland/useful/0.11.6/useful-0.11.6.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/core.specs.alpha/0.1.24/core.specs.alpha-0.1.24.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/hashp/hashp/0.2.1/hashp-0.2.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/borkdude/sci.impl.reflector/0.0.1/sci.impl.reflector-0.0.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/cognitect/transit-cljs/0.8.269/transit-cljs-0.8.269.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/slf4j/jcl-over-slf4j/1.6.2/jcl-over-slf4j-1.6.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/commons/commons-lang3/3.5/commons-lang3-3.5.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/wagon/wagon-http-shared/3.0.0/wagon-http-shared-3.0.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/potemkin/potemkin/0.4.5/potemkin-0.4.5.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-transport-file/1.0.3/maven-resolver-transport-file-1.0.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/tools.reader/1.3.6/tools.reader-1.3.6.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/failjure/failjure/2.2.0/failjure-2.2.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/riddley/riddley/0.1.12/riddley-0.1.12.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/data.json/2.4.0/data.json-2.4.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/codehaus/plexus/plexus-interpolation/1.24/plexus-interpolation-1.24.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/commons-logging/commons-logging/1.2/commons-logging-1.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/commons-codec/commons-codec/1.9/commons-codec-1.9.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/cider/cider-nrepl/0.28.3/cider-nrepl-0.28.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/cemerick/pomegranate/1.1.0/pomegranate-1.1.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/com/cognitect/transit-clj/1.0.329/transit-clj-1.0.329.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/tools.macro/0.1.1/tools.macro-0.1.1.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/borkdude/edamame/0.0.11-alpha.28/edamame-0.0.11-alpha.28.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/javassist/javassist/3.18.1-GA/javassist-3.18.1-GA.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/http-kit/http-kit/2.6.0/http-kit-2.6.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/medley/medley/1.4.0/medley-1.4.0.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/slf4j/slf4j-api/1.6.2/slf4j-api-1.6.2.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/clojure/spec.alpha/0.1.143/spec.alpha-0.1.143.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/maven-artifact/3.5.3/maven-artifact-3.5.3.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/clj-stacktrace/clj-stacktrace/0.2.8/clj-stacktrace-0.2.8.jar</td>
</tr>

<tr>
<td class="org-left"><i>home/keith</i>.m2/repository/org/apache/maven/resolver/maven-resolver-impl/1.1.1/maven-resolver-impl-1.1.1.jar</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Keith D Houser</p>
<p class="date">Created: 2022-08-01 Mon 16:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
